Config/InformationRegisters/ЗначенияДополнительныхРеквизитовОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхРеквизитовОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ОперацииДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОперацииДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСторнирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокИсправленияОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыявительОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВыявительОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОшибки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/РеквизитыТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеквизитыТиповыхОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТиповыеОперации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйРеквизитТиповойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеРеквизитыТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитПроводки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДляФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПоддержкиТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФункциональнойОпции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ЗначенияДополнительныхРеквизитовОпераций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТаблицуДопРеквизитов(Таблица)


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяТаблицаЗаполняемыеДополнительныхРекивизитов()

	Таблица = Новый ТаблицаЗначений;
	// Колонки, заполняемые для регистрации необходимости обработки
	Таблица.Колонки.Добавить("ТиповаяОперация", Новый ОписаниеТипов("СправочникСсылка.ТиповыеОперации"));
	Таблица.Колонки.Добавить("ИмяДляФормулы", ОбщегоНазначения.ОписаниеТипаСтрока("250"));
	Таблица.Колонки.Добавить("ЗначениеРеквизита", Новый ОписаниеТипов("Неопределено"));
	// если Истина, то ЗначениеРеквизита автоматически заполнится из ЗначенияПоУмолчанию
	Таблица.Колонки.Добавить("ИспользоватьЗначениеПоУмолчанию", Новый ОписаниеТипов("Булево"));
	// следует указать, если нужно очистить имеющееся значение
	Таблица.Колонки.Добавить("ОчищатьЗначениеРеквизита", Новый ОписаниеТипов("Булево"));
	
	// Колонки, заполняемые автоматически
	Таблица.Колонки.Добавить("ДополнительныйРеквизит", Новый ОписаниеТипов("СправочникСсылка.РеквизитыТиповыхОпераций"));
	Таблица.Колонки.Добавить("ИмяДокумента", ОбщегоНазначения.ОписаниеТипаСтрока("250"));
	
	Возврат Таблица;

КонецФункции

Функция ТаблицаЗаполняемыеДополнительныхРекивизитов()
	
	Таблица = ПустаяТаблицаЗаполняемыеДополнительныхРекивизитов();
	
	ЗаполнитьТаблицуДопРеквизитов(Таблица);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка КАК РеквизитОперации,
	|	РеквизитыТиповыхОпераций.Владелец КАК ТиповаяОперация,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	РеквизитыТиповыхОпераций.Владелец.ИдентификаторДокумента.Имя КАК ИмяДокумента
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец В(&ТиповыеОперации)
	|	И РеквизитыТиповыхОпераций.ИмяДляФормулы В(&ИменаРеквизитов)
	|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТиповыеОперации", Таблица.ВыгрузитьКолонку("ТиповаяОперация"));
	Запрос.УстановитьПараметр("ИменаРеквизитов", Таблица.ВыгрузитьКолонку("ИмяДляФормулы"));
	
	ТаблицаДопРеквизитов = Запрос.Выполнить().Выгрузить();
	ТаблицаДопРеквизитов.Индексы.Добавить("ТиповаяОперация, ИмяДляФормулы");
	
	НеНайденРеквизит = Новый Массив;
	НеЗаполненоЗначение = Новый Массив;
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
	
		СтрокиДопРеквизита = ТаблицаДопРеквизитов.НайтиСтроки(Новый Структура("ТиповаяОперация, ИмяДляФормулы",
			СтрокаТаблицы.ТиповаяОперация, СтрокаТаблицы.ИмяДляФормулы));
		
		Если СтрокиДопРеквизита.Количество() = 0 Тогда
			НеНайденРеквизит.Добавить(СтрокиДопРеквизита);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.ДополнительныйРеквизит = СтрокиДопРеквизита[0].РеквизитОперации;
		СтрокаТаблицы.ИмяДокумента = СтрокиДопРеквизита[0].ИмяДокумента;
		Если СтрокаТаблицы.ИспользоватьЗначениеПоУмолчанию Тогда
			СтрокаТаблицы.ЗначениеРеквизита = СтрокиДопРеквизита[0].ЗначениеПоУмолчанию;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеРеквизита)
			И НЕ СтрокаТаблицы.ОчищатьЗначениеРеквизита Тогда
			НеЗаполненоЗначение.Добавить(СтрокиДопРеквизита);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ИмяДокумента) Тогда
			СтрокаТаблицы.ИмяДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ТиповаяОперация,
				Новый Структура("ИмяДокумента", "ИдентификаторДокумента.Имя")).ИмяДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НеНайденРеквизит.Количество() > 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Ошибка при регистрации обработчика ""РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
			|Не найдены следующие дополнительные реквизиты типовых операций:
			|%РеквизитыТиповыхОпераций%'");
		МассивСтрок = Новый Массив;
		Для каждого ТекСтрока Из НеНайденРеквизит Цикл
		
			МассивСтрок.Добавить(СтрШаблон(НСтр("ru = '%1 - %2'"),
				ТекСтрока.ИмяДляФормулы, ТекСтрока.ТиповаяОперация));
		
		КонецЦикла;
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%РеквизитыТиповыхОпераций%",
			СтрСоединить(МассивСтрок, "," + Символы.ПС));
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
			УровеньЖурналаРегистрации.Предупреждение,,,ТекстСообщения);
		
	КонецЕсли;
	
	Если НеЗаполненоЗначение.Количество() > 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Ошибка при регистрации обработчика ""РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
			|Не заполнены значения следующих дополнительных реквизитов типовых операций:
			|%РеквизитыТиповыхОпераций%'");
		МассивСтрок = Новый Массив;
		Для каждого ТекСтрока Из НеЗаполненоЗначение Цикл
		
			МассивСтрок.Добавить(СтрШаблон(НСтр("ru = '%1 - %2'"),
				ТекСтрока.ИмяДляФормулы, ТекСтрока.ТиповаяОперация));
		
		КонецЦикла;
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%РеквизитыТиповыхОпераций%",
			СтрСоединить(МассивСтрок, "," + Символы.ПС));
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
			УровеньЖурналаРегистрации.Предупреждение,,,ТекстСообщения);
		
	КонецЕсли;
	
	Для каждого ТекСтрока Из НеНайденРеквизит Цикл
		Таблица.Удалить(ТекСтрока);
	КонецЦикла;
	
	Для каждого ТекСтрока Из НеЗаполненоЗначение Цикл
		Таблица.Удалить(ТекСтрока);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ТаблицаРеквизитов = ТаблицаЗаполняемыеДополнительныхРекивизитов();
	
	Если ТаблицаРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ОперацииДокументов.Документ КАК Документ,
	|	ЕСТЬNULL(ЗначенияДополнительныхРеквизитовОпераций.Значение, НЕОПРЕДЕЛЕНО) КАК Значение,
	|	&ЗначениеЗаполнения КАК ЗначениеЗаполнения,
	|	&ОчищатьЗначение КАК ОчищатьЗначение
	|ИЗ
	|	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	|		ПО ОперацииДокументов.Документ = ЗначенияДополнительныхРеквизитовОпераций.Объект
	|			И (ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации = &РеквизитОперации)
	|ГДЕ
	|	ОперацииДокументов.Операция = &Операция
	|	И ОперацииДокументов.Документ ССЫЛКА Документ.АвансовыйОтчет";
	НомерПараметра = 1;
	МассивТекстов = Новый Массив;
	Запрос = Новый Запрос;
	
	Для каждого ТекСтрока Из ТаблицаРеквизитов Цикл
		
		ТекстЗапроса = ШаблонЗапроса;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Операция", "&Операция" + НомерПараметра);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитОперации", "&РеквизитОперации" + НомерПараметра);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеЗаполнения", "&ЗначениеЗаполнения" + НомерПараметра);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОчищатьЗначение", "&ОчищатьЗначение" + НомерПараметра);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.АвансовыйОтчет", "Документ." + ТекСтрока.ИмяДокумента);
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("Операция" + НомерПараметра, ТекСтрока.ТиповаяОперация);
		Запрос.УстановитьПараметр("РеквизитОперации" + НомерПараметра, ТекСтрока.ДополнительныйРеквизит);
		Запрос.УстановитьПараметр("ЗначениеЗаполнения" + НомерПараметра, ТекСтрока.ЗначениеРеквизита);
		Запрос.УстановитьПараметр("ОчищатьЗначение" + НомерПараметра, ТекСтрока.ОчищатьЗначениеРеквизита);
	
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(МассивТекстов, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все"));
	
	ДанныеКОбработке = Новый ТаблицаЗначений;
	ДанныеКОбработке.Колонки.Добавить("Объект");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ОчищатьЗначение Тогда
			Если ЗначениеЗаполнено(Выборка.Значение) Тогда
				ДанныеКОбработке.Добавить().Объект = Выборка.Документ;
			КонецЕсли;
		Иначе
			Если Выборка.Значение <> Выборка.ЗначениеЗаполнения Тогда
				ДанныеКОбработке.Добавить().Объект = Выборка.Документ;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ДанныеКОбработке.Количество() > 0 Тогда
		
		ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
		ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
		ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций";
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДанныеКОбработке, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ТаблицаРеквизитов = ТаблицаЗаполняемыеДополнительныхРекивизитов();
	
	Если ТаблицаРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПолноеИмяРегистра = "РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций";
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметры.ИмяВременнойТаблицы = "ВТ_Документы";
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуИзмеренийНезависимогоРегистраСведенийДляОбработки(Параметры.Очередь,
		ПолноеИмяРегистра, МенеджерВременныхТаблиц, ДополнительныеПараметры);
		
	Если НЕ Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииДокументов.Документ КАК Документ,
	|	ОперацииДокументов.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|ГДЕ
	|	ОперацииДокументов.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_Документы.Объект КАК Объект
	|			ИЗ
	|				ВТ_Документы КАК ВТ_Документы)";
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций";
	
	ВыборкаДокументы = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДокументы.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДокументы.Операция) Тогда
			// типовая операция в документе уже не заполнена
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ВыборкаДокументы.Документ, ДополнительныеПараметры);
		КонецЕсли;
		
		РеквизитыТиповойОперации = ТаблицаРеквизитов.Скопировать(Новый Структура("ТиповаяОперация", ВыборкаДокументы.Операция));
		Если РеквизитыТиповойОперации.Количество() = 0 Тогда
			// типовая операция в документе изменилась
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ВыборкаДокументы.Документ, ДополнительныеПараметры);
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОперацииДокументов");
		ЭлементБлокировки.УстановитьЗначение("Документ", ВыборкаДокументы.Документ);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций");
		ЭлементБлокировки.УстановитьЗначение("Объект", ВыборкаДокументы.Документ);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка
		
			Блокировка.Заблокировать();
		
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось заблокировать регистры документа: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ВыборкаДокументы.Документ);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				ВыборкаДокументы.Документ.Метаданные(),
				ВыборкаДокументы.Документ,
				ТекстСообщения);
			ВызватьИсключение;
			
		КонецПопытки;
		
		Набор = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(ВыборкаДокументы.Документ);
		Набор.Прочитать();
		НаборИзменен = Ложь;
		
		Для каждого СтрокаРеквизитаОперации Из РеквизитыТиповойОперации Цикл
		
			РеквизитНайден = Ложь;
			Для каждого Запись Из Набор Цикл
			
				Если Запись.РеквизитОперации = СтрокаРеквизитаОперации.ДополнительныйРеквизит Тогда
					РеквизитНайден = Истина;
					Если СтрокаРеквизитаОперации.ОчищатьЗначениеРеквизита Тогда
						Если ЗначениеЗаполнено(Запись.Значение) Тогда
							Запись.Значение = Неопределено;
							НаборИзменен = Истина;
						КонецЕсли;
					Иначе
						Если Запись.Значение <> СтрокаРеквизитаОперации.ЗначениеРеквизита Тогда
							Запись.Значение = СтрокаРеквизитаОперации.ЗначениеРеквизита;
							НаборИзменен = Истина;
						КонецЕсли;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			Если НЕ РеквизитНайден Тогда
				Запись = Набор.Добавить();
				Запись.Объект = ВыборкаДокументы.Документ;
				Запись.РеквизитОперации = СтрокаРеквизитаОперации.ДополнительныйРеквизит;
				Если НЕ СтрокаРеквизитаОперации.ОчищатьЗначениеРеквизита Тогда
					Запись.Значение = СтрокаРеквизитаОперации.ЗначениеРеквизита;
				КонецЕсли;
				НаборИзменен = Истина;
			КонецЕсли;
		
		КонецЦикла;
		
		Если НЕ НаборИзменен Тогда
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ВыборкаДокументы.Документ, ДополнительныеПараметры);
			Продолжить;
		КонецЕсли;
		
		Попытка
		
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Истина);
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать дополнительные реквизиты операции документа: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ВыборкаДокументы.Документ);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				ВыборкаДокументы.Документ.Метаданные(),
				ВыборкаДокументы.Документ,
				ТекстСообщения);
			ВызватьИсключение;
			
		КонецПопытки;
	
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь,
		"РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
